[DaraFrame 과 Series 객체 생성]

[1] 모듈로딩 및 데이터 준비 <hr>

In [1]:
## [1-1] 모듈 로딩

import pandas as pd

In [2]:
# [1-2] 데이터 준비

data1 =[[10,20,30],[40,50,60]]

data2 =[['a','b']]
data3 ={'홍길동':[90,80], '마징가':[80,60],'베트맨':[90,70]}

[2] 데이터프레임 생성 <hr>

In [10]:
# Data1 ==> DataFrame 으로

pd.DataFrame(data1)

    0   1   2
0  10  20  30
1  40  50  60

In [5]:
# data1 ==> DataFrame 으로 
# 인덱스 ==> 'hong', 'Ma'
# 컬럼즈 ==> 'kor', 'Eng' , 'Math'

pd.DataFrame(data1, ['Hong','Ma'], ['kor','Eng',"Math"])

      kor  Eng  Math
Hong   10   20    30
Ma     40   50    60

In [6]:
# data1 ==> DataFrame 으로 
# 인덱스 ==> X
# 컬럼즈 ==> 'kor', 'Eng' , 'Math'

pd.DataFrame(data1, columns=['kor','Eng',"Math"])

   kor  Eng  Math
0   10   20    30
1   40   50    60

In [8]:
data_list = [['김은수','박정민','이하나'],[35,30,28],['과장','대리','대리']]

pd.DataFrame(data_list, columns=['이름','나이','직책'])

    이름   나이   직책
0  김은수  박정민  이하나
1   35   30   28
2   과장   대리  대리리

In [14]:
data_dic = {'이름':['김은수','박정민','이하나'],'나이':[35,30,28],'직책':['과장','대리','대리']}

pd.DataFrame(data_dic)

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [16]:
# [문1] 데이터,컬럼 있음, 인덱스X
data = [['김은수',35,'과장'],['박정민',30,'대리'],['이하나',28,'대리']]

pd.DataFrame(data)

     0   1   2
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [17]:
# [문2] 아래 데이터로 DataFrame 을 생성하세요.

data = [
    ["037730",'3R',1510,7.36],
    ["036360","3SOFT",1790, 1.65],
    ["005600","ACTS",1185,1.28]
]

columns = ["종목코드","종목명","현재가","등락률"]



pd.DataFrame(data, columns=columns)

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005600   ACTS  1185  1.28

[3] 시리즈 생성<hr>

In [19]:
# 데이터 : 홍길동, 25, 대구
# 데이터를 저장하기

pd.Series(['홍길동',25,'대구'])

0    홍길동
1     25
2     대구
dtype: object

In [20]:
# 데이터 : 홍길동, 25, 대구
# 데이터를 저장하기
# 데이터를 저장햇주세요.

pd.Series(['홍길동',25,'대구'], ['이름','나이','고향'])

이름    홍길동
나이     25
고향     대구
dtype: object

In [21]:

pd.Series([100,200,300], ['철수','영희','아름'])

철수    100
영희    200
아름    300
dtype: int64

In [23]:
# 딕셔너리 데이터 : {'철수': 100, '영희':200,'이름':300}

data = {'철수': 100, '영희':200,'아름':300}

pd.Series(data)

철수    100
영희    200
아름    300
dtype: int64